<?php
/**
 * MySQLに接続しデータを取得する
 *
 */

// 以下のコメントを外すと実行時エラーが発生した際にエラー内容が表示される
// ini_set('display_errors', 'On');
// ini_set('error_reporting', E_ALL);

//-------------------------------------------------
// 引数を受け取る
//-------------------------------------------------
// ユーザーIDを受け取る
$uid = isset($_GET['uid'])?  $_GET['uid']:null;

// Validation
if( ($uid === null) || (!is_numeric($uid)) ){
  sendResponse(false, 'Invalid uid');
  exit(1);
}

//-------------------------------------------------
// 準備
//-------------------------------------------------
require_once('../common.php');

// 実行したいSQL
$sql = 'SELECT * FROM User WHERE id=:id';  // Userテーブルの指定列を取得


//-------------------------------------------------
// SQLを実行
//-------------------------------------------------
try{
	startDB();
	
	// プレースホルダに値を入れる
	// 実行
	// 実行結果から1レコード取ってくる
	$buff = getDB($sql, [[':id', $uid]]);
}
catch( PDOException $e ) {
	sendResponse(false, 'Database error: '.$e->getMessage());  // 本来エラーメッセージはサーバ内のログへ保存する(悪意のある人間にヒントを与えない)
	exit(1);
}

//-------------------------------------------------
// 実行結果を返却
//-------------------------------------------------
resultResponse($buff, $buff, 'Not Fund user');
